# система создания пароля и входа

# это цикл
while True:
    ps = input("Придумайте пароль: ")
    ps2 = input("Повторите пароль: ")

    # сюда мы будем вводить пароль

    if ps != ps2:
        print("Пароли не совпадают")
    if ps == ps2:

        # если ps не равен ps2 то пароли не совпадают а если равен то цикл заканчивается и нам предлагаю войти

        break
print("Пароль создан, теперь вы можете войти")
while True:

    # новый цикл чтобы если ты ввёл неправильный пароль то ты мог ввести его снова

    log = input("Введите пароль: ")

    # сюда вводить пароль

    if ps2 == log:
        print("Вы успешно вошли")

        # если ps2 равен log то ма успешно входим

        break

        # цикл заканчивается

    elif ps2 != log:
        print("Пароль неверный")

        # если ps2 не равен log то пароль неверный
